-- random.lua

local PhoneFormat = {13, 15, 18}

math.randomseed(os.time())

random = {}

local SurnameDatabase = {
	"王", "李", "张", "刘", "陈", "杨", "黄", "周", "赵", "吴", 
	"孙", "徐", "林", "胡", "朱", "郭", "梁", "马", "高", "何",
	"郑", "罗", "宋", "谢", "叶", "韩", "任", "潘", "唐", "于", 
	"冯", "董", "吕", "邓", "许", "曹", "曾", "袁", "程", "田", 
	"彭", "钟", "蔡", "魏", "沈", "卢", "余", "杜", "蒋", "汪", 
	"丁", "方", "苏", "贾", "姜", "姚", "陆", "戴", "傅", "夏", 
	"廖", "萧", "石", "范", "金", "谭", "邹", "崔", "薛", "邱", 
	"史", "江", "侯", "邵", "肖", "熊", "康", "秦", "雷", "孟", 
	"白", "毛", "阎", "郝", "钱", "段", "俞", "洪", "顾", "贺", 
	"龚", "庞", "尹", "万", "龙", "赖", "孔", "武", "邢", "颜"
}

local MaleNameDatabase = {
	"嘉懿", "煜城", "懿轩", "烨伟", "苑博", "伟泽", "熠彤", "鸿煊", "博涛", "烨霖", 
	"烨华", "煜祺", "智宸", "正豪", "昊然", "明杰", "立诚", "立轩", "立辉", "峻熙",
	"弘文", "熠彤", "鸿煊", "烨霖", "哲瀚", "鑫鹏", "致远", "俊驰", "雨泽", "烨磊",
	"晟睿", "天佑", "文昊", "修洁", "黎昕", "远航", "旭尧", "鸿涛", "伟祺", "荣轩",
	"越泽", "浩宇", "瑾瑜", "皓轩", "擎苍", "擎宇", "志泽", "睿渊", "楷瑞", "子轩",
	"弘文", "哲瀚", "雨泽", "鑫磊", "修杰", "伟诚", "建辉", "晋鹏", "天磊", "绍辉",
	"泽洋", "明轩", "健柏", "鹏煊", "昊强", "伟宸", "博超", "君浩", "子骞", "明辉",
	"鹏涛", "炎彬", "鹤轩", "越彬", "风华", "靖琪", "明诚", "高格", "光华", "国源",
	"冠宇", "晗昱", "涵润", "翰飞", "翰海", "昊乾", "浩博", "和安", "弘博", "宏恺", 
	"鸿朗", "华奥", "华灿", "嘉慕", "坚秉", "建明", "金鑫", "锦程", "瑾瑜", "晋鹏", 
	"经赋", "景同", "靖琪", "君昊", "俊明", "季同", "开济", "凯安", "康成", "乐语", 
	"力勤", "良哲", "理群", "茂彦", "敏博", "明达", "朋义", "彭泽", "鹏举", "濮存", 
	"溥心", "璞瑜", "浦泽", "奇邃", "祺祥", "荣轩", "锐达", "睿慈", "绍祺", "圣杰", 
	"晟睿", "思源", "斯年", "泰宁", "天佑", "同巍", "奕伟", "祺温", "文虹", "向笛", 
	"心远", "欣德", "新翰", "兴言", "星阑", "修为", "旭尧", "炫明", "学真", "雪风", 
}

local FemaleNameDatabase = {
	"俊娟", "小蓉", "春元", "湘平", "惠琼", "昭君", "一菲", "秀琼", "淑娇", "雪琪",
	"碧莲", "亚菲", "雅轩", "诗琪", "依玲", "依玲", "淑燕", "玉琼", "静涵", "娉婷",
	"文怡", "静萍", "韵涵", "亦菲", "秋洁", "慧云", "香凝", "苏梅", "佳君", "泽慧",
	"静君", "星辰", "子桐", "慧艳", "紫怡", "灵燕", "惠燕", "淑怡", "梓桐", "思璇",
	"立涛", "思月", "文莲", "燕子", "嘉懿", "瑞婷", "蕊蕊", "逸菲", "翔云", "月芳",
	"晓怡", "静敏", "思晨", "焕英", "素琼", "丹青", "佳雪", "舒涵", "雅晴", "静燕",
	"勤勤", "梦涵", "佳露", "佳萍", "婷玉", "美秀", "桂娟", "慧怡", "诗韵", "逸菲",
	"苏琴", "美灵", "洪君", "月秋", "启敏", "舒涵", "素琼", "君燕", "晓轩", "佳瑶",
	"永慧", "美琪", "晓黎", "婉茹", "文竹", "小艺", "怡涵", "梦倩", "晓茹", "静娟",
	"慧云", "玉涵", "一彤", "新英", "梦娇", "小娇", "志方", "梦佳", "慧怡", "慧洁",
	"小曼", "彩珍", "晓琪", "沛沛", "丽芸", "明燕", "艺涵", "晨晓", "正芳", "淑怡",
	"家慧", "灵灵", "晓非", "梦竹", "芳丽", "蕊蕊", "晋芳", "学燕", "宇晴", "华梅",
	"茵茵", "婉秋", "晓琼", "佳惠", "佳淇", "淑静", "丽珊", "淑燕", "俊兰", "佳星",
	"子晴", "静仪", "静慧", "一宁", "苏云", "一婷", "海棠", "可佳", "芳琴", "素素",
	"舒雅", "子晴", "心月", "可怡", "碧红", "亦菲", "慧洁", "泽慧", "雅琼", "冰玉",
}

local JobsDatabase = {
	"计算机硬件",
	"计算机软件",
	"互联网开发及应用",
	"IT-管理",
	"通信技术",
	"电子/电器/半导体/仪器仪表",
	"销售管理",
	"销售人员",
	"销售行政及商务",
	"客服及技术支持",
	"财务",
	"审计",
	"税务",
	"证券",
	"金融",
	"投资",
	"银行",
	"保险",
	"人力资源",
	"高级管理"
}

local RegionDatabase = {
	"上海",
	"云南",
	"内蒙古",
	"北京",
	"吉林",
	"四川",
	"天津",
	"宁夏",
	"安徽",
	"山东",
	"山西",
	"广东",
	"广西",
	"新疆",
	"江苏",
	"江西",
	"河北",
	"河南",
	"浙江",
	"海南",
	"湖北",
	"湖南",
	"甘肃",
	"福建",
	"西藏",
	"贵州",
	"辽宁",
	"重庆",
	"陕西",
	"青海",
	"黑龙江",
}

local CitysDatabase = {
	["北京"] = { "东城区", "西城区", "崇文区", "宣武区", "朝阳区", "海淀区", "丰台区", "石景山区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "门头沟区", "密云县", "延庆县", }, 
	["广东"] = { "广州", "深圳", "珠海", "汕头", "韶关", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮", }, 
	["上海"] = { "黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "宝山区", "闵行区", "嘉定区", "松江区", "金山区", "青浦区", "南汇区", "奉贤区", "浦东新区", "崇明县", }, 
	["天津"] = { "和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "北辰区", "津南区", "武清区", "宝坻区", "静海县", "宁河县", "蓟县", }, 
	["重庆"] = { "渝中区", "大渡口区", "江北区", "南岸区", "北碚区", "渝北区", "巴南区", "长寿区", "双桥区", "沙坪坝区", "万盛区", "万州区", "涪陵区", "黔江区", "永川区", "合川区", "江津区", "九龙坡区", "南川区", "綦江县", "潼南县", "荣昌县", "璧山县", "大足县", "铜梁县", "梁平县", "开县", "忠县", "城口县", "垫江县", "武隆县", "丰都县", "奉节县", "云阳县", "巫溪县", "巫山县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", }, 
	["辽宁"] = { "沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛", }, 
	["江苏"] = { "南京", "苏州", "无锡", "常州", "镇江", "南通", "泰州", "扬州", "盐城", "连云港", "徐州", "淮安", "宿迁", }, 
	["湖北"] = { "武汉", "黄石", "十堰", "荆州", "宜昌", "襄樊", "鄂州", "荆门", "孝感", "黄冈", "咸宁", "随州", "恩施土家族苗族自治州", "仙桃", "天门", "潜江", "神农架林区", }, 
	["四川"] = { "成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州", }, 
	["陕西"] = { "西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛", }, 
	["河北"] = { "石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水", }, 
	["山西"] = { "太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁", }, 
	["河南"] = { "郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店", "焦作", }, 
	["吉林"] = { "长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边朝鲜族自治州", }, 
	["黑龙江"] = { "哈尔滨", "齐齐哈尔", "鹤岗", "双鸭山", "鸡西", "大庆", "伊春", "牡丹江", "佳木斯", "七台河", "黑河", "绥化", "大兴安岭地区", }, 
	["内蒙古"] = { "呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "锡林郭勒盟", "兴安盟", "阿拉善盟", }, 
	["山东"] = { "济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽", }, 
	["安徽"] = { "合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "巢湖", "六安", "亳州", "池州", "宣城", }, 
	["浙江"] = { "杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水", }, 
	["福建"] = { "福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德", }, 
	["湖南"] = { "长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西土家族苗族自治州", }, 
	["广西"] = { "南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左", }, 
	["江西"] = { "南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶", }, 
	["贵州"] = { "贵阳", "六盘水", "遵义", "安顺", "铜仁地区", "毕节地区", "黔西南布依族苗族自治州", "黔东南苗族侗族自治州", "黔南布依族苗族自治州", }, 
	["云南"] = { "昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州", "大理白族自治州", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州", }, 
	["西藏"] = { "拉萨", "那曲地区", "昌都地区", "林芝地区", "山南地区", "日喀则地区", "阿里地区", }, 
	["海南"] = { "海口", "三亚", "五指山", "琼海", "儋州", "文昌", "万宁", "东方", "澄迈县", "定安县", "屯昌县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县", "保亭黎族苗族自治县", "琼中黎族苗族自治县", }, 
	["甘肃"] = { "兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "酒泉", "张掖", "庆阳", "平凉", "定西", "陇南", "临夏回族自治州", "甘南藏族自治州", }, 
	["宁夏"] = { "银川", "石嘴山", "吴忠", "固原", "中卫", }, 
	["青海"] = { "西宁", "海东地区", "海北藏族自治州", "海南藏族自治州", "黄南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州", }, 
	["新疆"] = { "乌鲁木齐", "克拉玛依", "吐鲁番地区", "哈密地区", "和田地区", "阿克苏地区", "喀什地区", "克孜勒苏柯尔克孜自治州", "巴音郭楞蒙古自治州", "昌吉回族自治州", "博尔塔拉蒙古自治州", "石河子", "阿拉尔", "图木舒克", "五家渠", "伊犁哈萨克自治州", }, 
	["香港"] = { "中西区", "湾仔区", "东区", "南区", "深水埗区", "油尖旺区", "九龙城区", "黄大仙区", "观塘区", "北区", "大埔区", "沙田区", "西贡区", "元朗区", "屯门区", "荃湾区", "葵青区", "离岛区", }, 
	["澳门"] = { "花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区", "圣方济各堂区", "路凼", }, 
	["台湾"] = { "台北市", "高雄市", "台北县", "桃园县", "新竹县", "苗栗县", "台中县", "彰化县", "南投县", "云林县", "嘉义县", "台南县", "高雄县", "屏东县", "宜兰县", "花莲县", "台东县", "澎湖县", "基隆市", "新竹市", "台中市", "嘉义市", "台南市", }, 
	["海外"] = { }, 
}

local RoadsDatabase = {
	"北大街", "人民路", "南大街", "解放路", "西大街", "中山路", "滨江路", "江滨路", "建设路", "文化路",
	"新华路", "建国路", "中华路", "东风路", "朝阳路", "环城路", "长安街", "南京路", "江苏路", "四川路",
	"河南路", "山东路", "山西路", "福建路", "广西路", "苏州路", "北京路", "宁波路", "天津路", "杭州路",
	"汉口路", "福州路", "广东路", "香港路", "绍兴路", "济南路", "长沙路", "合肥路", "济南路", "青岛路"
}

local CommunityDatabase = {
	"绿园仙境", "欧兰幽梦", "碧波云景", "温馨绿城", "森和阳光小区", "福慧安家园", "美康华小区", "瑞丽湾小区",
	"香丽舍小区", "东方爱琴堡", "妙思湾小区", "岚福新苑", "家格达小区", "澜波湾小区", "香榭丽舍", "塞纳风光小区",
	"锦绣佳苑", "梦想和居小区", "绿洲花园小区", "龙祥庄园", "福乐苑小区", "万原宜城", "贝勒庄园", "都市闲居", 
	"乐城草原", "蝶萃别居", "福祥苑小区", "安居里小区", "凤凰苑", "俪景别庭", "庆苑别院", "南山天府", "牧野宜居",
	"宜和居", "世嘉豪宅", "东郡华府", "翡翠城", "碧水云涧", "福泰新城", "塞外巴黎小区", "爱丁堡", "绿洲城堡", "博爵嘉苑", "水岸林邸"
}

function random.UDID()
	return ""--UDIDDatabase[math.random(1, 1500)]
end

function random.phone()
	local phone = tostring(PhoneFormat[math.random(1, 3)])
	for _=1,9 do
		phone = phone..tostring(math.random(0, 9))
	end
	return phone
end

function random.year()
	return tostring(math.random(1980, 1995))
end

function random.surname()
	return SurnameDatabase[math.random(1, 100)]
end

function random.male()
	local index = math.random(1, 4)
	if index == 4 then
		return false
	else
		return true
	end
end

function random.name(male)
	if type(male) == "nil" then male = random.male() end

	local index = math.random(1, 150)

	if male then
		return MaleNameDatabase[index]
	else
		return FemaleNameDatabase[index]
	end
end

function random.month()
	return math.random(1, 12)
end

function random.day()
	return math.random(1, 10)
end

function random.char(minLength, maxLength, lower_case, upper_case, digit)
	if type(maxLength) == "boolean" then
		digit = upper_case
		upper_case = lower_case
		lower_case = maxLength
		maxLength = minLength
	end
	
	if lower_case==nil	then lower_case = true 	end
	if upper_case==nil	then upper_case = true 	end
	if digit==nil		then digit = false 		end
	
	local data = ""
	if lower_case	then data = data.."abcdefghijklmnopqrstuvwxyz"	end
	if upper_case	then data = data.."ABCDEFGHIJKLMNOPQRSTUVWXYZ"	end
	if digit		then data = data.."0123456789"					end

	local length = math.random(minLength, maxLength)
	
	local res = ""
	local dataLen = string.len(data)

	for _=1,length do
		local index = math.random(1, dataLen)
		res = res..string.sub(data, index, index)
	end
	return res
end

function random.email()
	local user = random.char(8, 20, true, true, false)
	local domain = random.char(2, 6, true, false, false)
	return user.."@"..domain..".com"
end

function random.password()
	local upper_case = random.char(2, 2, false, true, false)
	local lower_case = random.char(2, 2, true, false, false)
	local digit = random.char(2, 2, false, false, true)
	local other = random.char(2, 2, true, true, true)
	return upper_case..lower_case..digit..other
end

function random.province()
	local index,province = random.region()
	return province
end

function random.region()
	local index = math.random(1, #RegionDatabase)
	return index,RegionDatabase[index]
end

function random.city(region)
	local citys = CitysDatabase[region]
	local index = math.random(1, #citys)
	return citys[index]
end

function random.region_city()
	local index,region = random.region()
	local city = random.city(region)
	return index,city
end

function random.job()
	return JobsDatabase[math.random(1, 20)]
end

function random.address()
	return RoadsDatabase[math.random(1, #RoadsDatabase)]..math.random(1,100).."号"..CommunityDatabase[math.random(1, #CommunityDatabase)]..math.random(1, 30).."幢"..math.random(1,9).."0"..math.random(1,9).."室"
end

